Terraform plan for environment: dev

```
stdout<<ghadelimiter_04d1c2bf-bfeb-4f43-aa79-773f0c298542
Terraform v1.7.4
on linux_amd64

ghadelimiter_04d1c2bf-bfeb-4f43-aa79-773f0c298542
stderr<<ghadelimiter_811ba26a-ac4d-40d2-b9d2-0dcf2c8642a0

ghadelimiter_811ba26a-ac4d-40d2-b9d2-0dcf2c8642a0
exitcode<<ghadelimiter_304641c9-86b4-45ff-a6dd-30dd7935e0f8
0
ghadelimiter_304641c9-86b4-45ff-a6dd-30dd7935e0f8
stdout<<ghadelimiter_72e452f3-ede2-48b7-8ff4-02b5668646c9
Terraform v1.7.4
on linux_amd64

ghadelimiter_72e452f3-ede2-48b7-8ff4-02b5668646c9
stderr<<ghadelimiter_42a29fe6-b920-4f84-8d0f-5ffe34f10636

ghadelimiter_42a29fe6-b920-4f84-8d0f-5ffe34f10636
exitcode<<ghadelimiter_e20ecab1-a29c-404c-8662-53481a555936
0
ghadelimiter_e20ecab1-a29c-404c-8662-53481a555936
stdout<<ghadelimiter_ed0aa447-2f0f-418b-858f-af7ff35d7839
Terraform v1.7.4
on linux_amd64

ghadelimiter_ed0aa447-2f0f-418b-858f-af7ff35d7839
stderr<<ghadelimiter_4bf7b7c1-7dfe-43b4-911d-6e53e81460b0

ghadelimiter_4bf7b7c1-7dfe-43b4-911d-6e53e81460b0
exitcode<<ghadelimiter_4b3c05ee-31de-4f72-a9ad-c1759a6fa345
0
ghadelimiter_4b3c05ee-31de-4f72-a9ad-c1759a6fa345
stdout<<ghadelimiter_3866c97c-8b0d-4907-8407-04c883eeeb45
Terraform v1.7.4
on linux_amd64

ghadelimiter_3866c97c-8b0d-4907-8407-04c883eeeb45
stderr<<ghadelimiter_c558deff-35fc-48f4-a68c-717faa5bcd4b

ghadelimiter_c558deff-35fc-48f4-a68c-717faa5bcd4b
exitcode<<ghadelimiter_fb7a551f-6222-4219-a0de-0c26eb855394
0
ghadelimiter_fb7a551f-6222-4219-a0de-0c26eb855394

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m
[0m[1mInitializing modules...[0m
Downloading git::https://github.com/terraform-aws-modules/terraform-aws-sns.git?ref=718832512ecfd0af00311a181537692003ddc1bb for sns...
- sns in .terraform/modules/sns

[0m[1mInitializing provider plugins...[0m
- Finding hashicorp/aws versions matching ">= 5.25.0, 5.33.0"...
- Installing hashicorp/aws v5.33.0...
- Installed hashicorp/aws v5.33.0 (signed by HashiCorp)

Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
stdout<<ghadelimiter_8dfcffa5-40ee-4a81-9e07-f92a79296303

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m
[0m[1mInitializing modules...[0m
Downloading git::https://github.com/terraform-aws-modules/terraform-aws-sns.git?ref=718832512ecfd0af00311a181537692003ddc1bb for sns...
- sns in .terraform/modules/sns

[0m[1mInitializing provider plugins...[0m
- Finding hashicorp/aws versions matching ">= 5.25.0, 5.33.0"...
- Installing hashicorp/aws v5.33.0...
- Installed hashicorp/aws v5.33.0 (signed by HashiCorp)

Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m

ghadelimiter_8dfcffa5-40ee-4a81-9e07-f92a79296303
stderr<<ghadelimiter_0e9773ae-d79a-40a3-8b6a-dd466d1de379

ghadelimiter_0e9773ae-d79a-40a3-8b6a-dd466d1de379
exitcode<<ghadelimiter_228ebe11-3474-40a6-8870-bd234b8b94d4
0
ghadelimiter_228ebe11-3474-40a6-8870-bd234b8b94d4

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m
[0m[1mInitializing modules...[0m
Downloading git::https://github.com/clouddrove/terraform-aws-lightsail.git?ref=a93867cceb9995ad72e96fc57e1f3be837ed335f for lightsail...
- lightsail in .terraform/modules/lightsail
Downloading registry.terraform.io/clouddrove/labels/aws 1.3.0 for lightsail.labels...
- lightsail.labels in .terraform/modules/lightsail.labels

[0m[1mInitializing provider plugins...[0m
- Finding hashicorp/aws versions matching ">= 5.9.0, 5.33.0"...
- Installing hashicorp/aws v5.33.0...
- Installed hashicorp/aws v5.33.0 (signed by HashiCorp)

Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
stdout<<ghadelimiter_ea73f879-3ec1-4cc4-bbfc-53583e86f8bd

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m
[0m[1mInitializing modules...[0m
Downloading git::https://github.com/clouddrove/terraform-aws-lightsail.git?ref=a93867cceb9995ad72e96fc57e1f3be837ed335f for lightsail...
- lightsail in .terraform/modules/lightsail
Downloading registry.terraform.io/clouddrove/labels/aws 1.3.0 for lightsail.labels...
- lightsail.labels in .terraform/modules/lightsail.labels

[0m[1mInitializing provider plugins...[0m
- Finding hashicorp/aws versions matching ">= 5.9.0, 5.33.0"...
- Installing hashicorp/aws v5.33.0...
- Installed hashicorp/aws v5.33.0 (signed by HashiCorp)

Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m

ghadelimiter_ea73f879-3ec1-4cc4-bbfc-53583e86f8bd
stderr<<ghadelimiter_18b8d47e-20b9-47e9-858e-7d085215be3b

ghadelimiter_18b8d47e-20b9-47e9-858e-7d085215be3b
exitcode<<ghadelimiter_98bea170-c37e-4ab9-8e92-164169f49e13
0
ghadelimiter_98bea170-c37e-4ab9-8e92-164169f49e13

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m
[0m[1mInitializing modules...[0m
Downloading git::https://github.com/terraform-aws-modules/terraform-aws-lambda.git?ref=be31ada3e1330ea3bf7d784edd559980b07eb2c2 for create_instance_snapshot_lambda...
- create_instance_snapshot_lambda in .terraform/modules/create_instance_snapshot_lambda
Downloading git::https://github.com/terraform-aws-modules/terraform-aws-eventbridge.git?ref=6d2d61d7ec5781563648937319d018b01d4ddfe6 for eventbridge...
- eventbridge in .terraform/modules/eventbridge
Downloading git::https://github.com/terraform-aws-modules/terraform-aws-iam?ref=e63dff8de9f6aee7e9ebfbe8c676fa980f5233c0 for iam_assumable_role_custom_trust_policy...
- iam_assumable_role_custom_trust_policy in .terraform/modules/iam_assumable_role_custom_trust_policy/modules/iam-assumable-role
Downloading git::https://github.com/terraform-aws-modules/terraform-aws-iam?ref=e63dff8de9f6aee7e9ebfbe8c676fa980f5233c0 for iam_policy...
- iam_policy in .terraform/modules/iam_policy/modules/iam-policy
Downloading git::https://github.com/terraform-aws-modules/terraform-aws-lambda.git?ref=be31ada3e1330ea3bf7d784edd559980b07eb2c2 for prune_instance_snapshot_lambda...
- prune_instance_snapshot_lambda in .terraform/modules/prune_instance_snapshot_lambda

[0m[1mInitializing provider plugins...[0m
- Finding hashicorp/aws versions matching ">= 4.0.0, >= 4.63.0, >= 5.9.0, 5.33.0"...
- Finding latest version of hashicorp/archive...
- Finding hashicorp/external versions matching ">= 1.0.0"...
- Finding hashicorp/local versions matching ">= 1.0.0"...
- Finding hashicorp/null versions matching ">= 2.0.0"...
- Installing hashicorp/local v2.4.1...
- Installed hashicorp/local v2.4.1 (signed by HashiCorp)
- Installing hashicorp/null v3.2.2...
- Installed hashicorp/null v3.2.2 (signed by HashiCorp)
- Installing hashicorp/aws v5.33.0...
- Installed hashicorp/aws v5.33.0 (signed by HashiCorp)
- Installing hashicorp/archive v2.4.2...
- Installed hashicorp/archive v2.4.2 (signed by HashiCorp)
- Installing hashicorp/external v2.3.3...
- Installed hashicorp/external v2.3.3 (signed by HashiCorp)

Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
stdout<<ghadelimiter_9c7db977-5475-46a7-9fbd-a229ebeea500

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m
[0m[1mInitializing modules...[0m
Downloading git::https://github.com/terraform-aws-modules/terraform-aws-lambda.git?ref=be31ada3e1330ea3bf7d784edd559980b07eb2c2 for create_instance_snapshot_lambda...
- create_instance_snapshot_lambda in .terraform/modules/create_instance_snapshot_lambda
Downloading git::https://github.com/terraform-aws-modules/terraform-aws-eventbridge.git?ref=6d2d61d7ec5781563648937319d018b01d4ddfe6 for eventbridge...
- eventbridge in .terraform/modules/eventbridge
Downloading git::https://github.com/terraform-aws-modules/terraform-aws-iam?ref=e63dff8de9f6aee7e9ebfbe8c676fa980f5233c0 for iam_assumable_role_custom_trust_policy...
- iam_assumable_role_custom_trust_policy in .terraform/modules/iam_assumable_role_custom_trust_policy/modules/iam-assumable-role
Downloading git::https://github.com/terraform-aws-modules/terraform-aws-iam?ref=e63dff8de9f6aee7e9ebfbe8c676fa980f5233c0 for iam_policy...
- iam_policy in .terraform/modules/iam_policy/modules/iam-policy
Downloading git::https://github.com/terraform-aws-modules/terraform-aws-lambda.git?ref=be31ada3e1330ea3bf7d784edd559980b07eb2c2 for prune_instance_snapshot_lambda...
- prune_instance_snapshot_lambda in .terraform/modules/prune_instance_snapshot_lambda

[0m[1mInitializing provider plugins...[0m
- Finding hashicorp/aws versions matching ">= 4.0.0, >= 4.63.0, >= 5.9.0, 5.33.0"...
- Finding latest version of hashicorp/archive...
- Finding hashicorp/external versions matching ">= 1.0.0"...
- Finding hashicorp/local versions matching ">= 1.0.0"...
- Finding hashicorp/null versions matching ">= 2.0.0"...
- Installing hashicorp/local v2.4.1...
- Installed hashicorp/local v2.4.1 (signed by HashiCorp)
- Installing hashicorp/null v3.2.2...
- Installed hashicorp/null v3.2.2 (signed by HashiCorp)
- Installing hashicorp/aws v5.33.0...
- Installed hashicorp/aws v5.33.0 (signed by HashiCorp)
- Installing hashicorp/archive v2.4.2...
- Installed hashicorp/archive v2.4.2 (signed by HashiCorp)
- Installing hashicorp/external v2.3.3...
- Installed hashicorp/external v2.3.3 (signed by HashiCorp)

Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m

ghadelimiter_9c7db977-5475-46a7-9fbd-a229ebeea500
stderr<<ghadelimiter_5ffbe4d5-08b5-44e2-a992-63d881f8145c

ghadelimiter_5ffbe4d5-08b5-44e2-a992-63d881f8145c
exitcode<<ghadelimiter_70d54fcc-8d65-4641-b931-e4ab3166db6f
0
ghadelimiter_70d54fcc-8d65-4641-b931-e4ab3166db6f
[0m[1mmodule.sns.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.sns.data.aws_caller_identity.current: Read complete after 0s [id=074217812019][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # module.sns.data.aws_iam_policy_document.this[0][0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_iam_policy_document" "this" {
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m json                      = (known after apply)
      [32m+[0m[0m override_policy_documents = []
      [32m+[0m[0m source_policy_documents   = []

      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "sns:AddPermission",
              [32m+[0m[0m "sns:DeleteTopic",
              [32m+[0m[0m "sns:GetTopicAttributes",
              [32m+[0m[0m "sns:ListSubscriptionsByTopic",
              [32m+[0m[0m "sns:Publish",
              [32m+[0m[0m "sns:RemovePermission",
              [32m+[0m[0m "sns:SetTopicAttributes",
              [32m+[0m[0m "sns:Subscribe",
            ]
          [32m+[0m[0m effect    = "Allow"
          [32m+[0m[0m resources = [
              [32m+[0m[0m (known after apply),
            ]
          [32m+[0m[0m sid       = "__default_statement_ID"

          [32m+[0m[0m condition {
              [32m+[0m[0m test     = "StringEquals"
              [32m+[0m[0m values   = [
                  [32m+[0m[0m "074217812019",
                ]
              [32m+[0m[0m variable = "AWS:SourceOwner"
            }

          [32m+[0m[0m principals {
              [32m+[0m[0m identifiers = [
                  [32m+[0m[0m "*",
                ]
              [32m+[0m[0m type        = "AWS"
            }
        }
    }

[1m  # module.sns.aws_sns_topic.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_sns_topic" "this" {
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m beginning_archive_time      = (known after apply)
      [32m+[0m[0m content_based_deduplication = false
      [32m+[0m[0m fifo_topic                  = false
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m name                        = "LambdaLightSailSnapshotsSnsTopic"
      [32m+[0m[0m name_prefix                 = (known after apply)
      [32m+[0m[0m owner                       = (known after apply)
      [32m+[0m[0m policy                      = (known after apply)
      [32m+[0m[0m signature_version           = (known after apply)
      [32m+[0m[0m tags_all                    = (known after apply)
      [32m+[0m[0m tracing_config              = (known after apply)
    }

[1m  # module.sns.aws_sns_topic_policy.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_sns_topic_policy" "this" {
      [32m+[0m[0m arn    = (known after apply)
      [32m+[0m[0m id     = (known after apply)
      [32m+[0m[0m owner  = (known after apply)
      [32m+[0m[0m policy = (known after apply)
    }

[1m  # module.sns.aws_sns_topic_subscription.this["sms"][0m will be created
[0m  [32m+[0m[0m resource "aws_sns_topic_subscription" "this" {
      [32m+[0m[0m arn                             = (known after apply)
      [32m+[0m[0m confirmation_timeout_in_minutes = 1
      [32m+[0m[0m confirmation_was_authenticated  = (known after apply)
      [32m+[0m[0m endpoint                        = "07483846019"
      [32m+[0m[0m endpoint_auto_confirms          = false
      [32m+[0m[0m filter_policy_scope             = (known after apply)
      [32m+[0m[0m id                              = (known after apply)
      [32m+[0m[0m owner_id                        = (known after apply)
      [32m+[0m[0m pending_confirmation            = (known after apply)
      [32m+[0m[0m protocol                        = "sms"
      [32m+[0m[0m raw_message_delivery            = false
      [32m+[0m[0m topic_arn                       = (known after apply)
    }

[1mPlan:[0m 3 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m arn_topic = (known after apply)
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
stdout<<ghadelimiter_1dbd4138-ada7-43a0-ba50-22ae1ca01bae
[0m[1mmodule.sns.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.sns.data.aws_caller_identity.current: Read complete after 0s [id=074217812019][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # module.sns.data.aws_iam_policy_document.this[0][0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_iam_policy_document" "this" {
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m json                      = (known after apply)
      [32m+[0m[0m override_policy_documents = []
      [32m+[0m[0m source_policy_documents   = []

      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "sns:AddPermission",
              [32m+[0m[0m "sns:DeleteTopic",
              [32m+[0m[0m "sns:GetTopicAttributes",
              [32m+[0m[0m "sns:ListSubscriptionsByTopic",
              [32m+[0m[0m "sns:Publish",
              [32m+[0m[0m "sns:RemovePermission",
              [32m+[0m[0m "sns:SetTopicAttributes",
              [32m+[0m[0m "sns:Subscribe",
            ]
          [32m+[0m[0m effect    = "Allow"
          [32m+[0m[0m resources = [
              [32m+[0m[0m (known after apply),
            ]
          [32m+[0m[0m sid       = "__default_statement_ID"

          [32m+[0m[0m condition {
              [32m+[0m[0m test     = "StringEquals"
              [32m+[0m[0m values   = [
                  [32m+[0m[0m "074217812019",
                ]
              [32m+[0m[0m variable = "AWS:SourceOwner"
            }

          [32m+[0m[0m principals {
              [32m+[0m[0m identifiers = [
                  [32m+[0m[0m "*",
                ]
              [32m+[0m[0m type        = "AWS"
            }
        }
    }

[1m  # module.sns.aws_sns_topic.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_sns_topic" "this" {
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m beginning_archive_time      = (known after apply)
      [32m+[0m[0m content_based_deduplication = false
      [32m+[0m[0m fifo_topic                  = false
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m name                        = "LambdaLightSailSnapshotsSnsTopic"
      [32m+[0m[0m name_prefix                 = (known after apply)
      [32m+[0m[0m owner                       = (known after apply)
      [32m+[0m[0m policy                      = (known after apply)
      [32m+[0m[0m signature_version           = (known after apply)
      [32m+[0m[0m tags_all                    = (known after apply)
      [32m+[0m[0m tracing_config              = (known after apply)
    }

[1m  # module.sns.aws_sns_topic_policy.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_sns_topic_policy" "this" {
      [32m+[0m[0m arn    = (known after apply)
      [32m+[0m[0m id     = (known after apply)
      [32m+[0m[0m owner  = (known after apply)
      [32m+[0m[0m policy = (known after apply)
    }

[1m  # module.sns.aws_sns_topic_subscription.this["sms"][0m will be created
[0m  [32m+[0m[0m resource "aws_sns_topic_subscription" "this" {
      [32m+[0m[0m arn                             = (known after apply)
      [32m+[0m[0m confirmation_timeout_in_minutes = 1
      [32m+[0m[0m confirmation_was_authenticated  = (known after apply)
      [32m+[0m[0m endpoint                        = "07483846019"
      [32m+[0m[0m endpoint_auto_confirms          = false
      [32m+[0m[0m filter_policy_scope             = (known after apply)
      [32m+[0m[0m id                              = (known after apply)
      [32m+[0m[0m owner_id                        = (known after apply)
      [32m+[0m[0m pending_confirmation            = (known after apply)
      [32m+[0m[0m protocol                        = "sms"
      [32m+[0m[0m raw_message_delivery            = false
      [32m+[0m[0m topic_arn                       = (known after apply)
    }

[1mPlan:[0m 3 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m arn_topic = (known after apply)
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

ghadelimiter_1dbd4138-ada7-43a0-ba50-22ae1ca01bae
stderr<<ghadelimiter_9662b6e5-8fe1-448a-8b17-321d36cf2eff

ghadelimiter_9662b6e5-8fe1-448a-8b17-321d36cf2eff
exitcode<<ghadelimiter_a916ae16-eeff-481b-b487-b8bc53e324e2
0
ghadelimiter_a916ae16-eeff-481b-b487-b8bc53e324e2

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # module.lightsail.aws_lightsail_domain.test[0][0m will be created
[0m  [32m+[0m[0m resource "aws_lightsail_domain" "test" {
      [32m+[0m[0m arn         = (known after apply)
      [32m+[0m[0m domain_name = "clouddrove.ca"
      [32m+[0m[0m id          = (known after apply)
    }

[1m  # module.lightsail.aws_lightsail_instance.instance[0][0m will be created
[0m  [32m+[0m[0m resource "aws_lightsail_instance" "instance" {
      [32m+[0m[0m arn                = (known after apply)
      [32m+[0m[0m availability_zone  = (sensitive value)
      [32m+[0m[0m blueprint_id       = (sensitive value)
      [32m+[0m[0m bundle_id          = (sensitive value)
      [32m+[0m[0m cpu_count          = (known after apply)
      [32m+[0m[0m created_at         = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m ip_address_type    = "dualstack"
      [32m+[0m[0m ipv6_addresses     = (known after apply)
      [32m+[0m[0m is_static_ip       = (known after apply)
      [32m+[0m[0m name               = "flick-loco-01_lightsail-0"
      [32m+[0m[0m private_ip_address = (known after apply)
      [32m+[0m[0m public_ip_address  = (known after apply)
      [32m+[0m[0m ram_size           = (known after apply)
      [32m+[0m[0m tags               = {
          [32m+[0m[0m "Environment" = "01_lightsail"
          [32m+[0m[0m "Managedby"   = "hello@clouddrove.com"
          [32m+[0m[0m "Name"        = "flick-loco-01_lightsail-0"
          [32m+[0m[0m "Repository"  = "https://github.com/clouddrove/terraform-aws-lightsail"
        }
      [32m+[0m[0m tags_all           = {
          [32m+[0m[0m "Environment" = "01_lightsail"
          [32m+[0m[0m "Managedby"   = "hello@clouddrove.com"
          [32m+[0m[0m "Name"        = "flick-loco-01_lightsail-0"
          [32m+[0m[0m "Repository"  = "https://github.com/clouddrove/terraform-aws-lightsail"
        }
      [32m+[0m[0m username           = (known after apply)
    }

[1m  # module.lightsail.aws_lightsail_instance_public_ports.public[0m will be created
[0m  [32m+[0m[0m resource "aws_lightsail_instance_public_ports" "public" {
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m instance_name = "flick-loco-01_lightsail-0"

      [32m+[0m[0m port_info {
          [32m+[0m[0m cidr_list_aliases = (known after apply)
          [32m+[0m[0m cidrs             = [
              [32m+[0m[0m "0.0.0.0/0",
            ]
          [32m+[0m[0m from_port         = 22
          [32m+[0m[0m ipv6_cidrs        = (known after apply)
          [32m+[0m[0m protocol          = "tcp"
          [32m+[0m[0m to_port           = 22
        }
      [32m+[0m[0m port_info {
          [32m+[0m[0m cidr_list_aliases = (known after apply)
          [32m+[0m[0m cidrs             = [
              [32m+[0m[0m "0.0.0.0/0",
            ]
          [32m+[0m[0m from_port         = 80
          [32m+[0m[0m ipv6_cidrs        = (known after apply)
          [32m+[0m[0m protocol          = "tcp"
          [32m+[0m[0m to_port           = 80
        }
    }

[1m  # module.lightsail.aws_lightsail_static_ip.instance[0][0m will be created
[0m  [32m+[0m[0m resource "aws_lightsail_static_ip" "instance" {
      [32m+[0m[0m arn          = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m ip_address   = (known after apply)
      [32m+[0m[0m name         = "flick-loco-01_lightsail-IP-0"
      [32m+[0m[0m support_code = (known after apply)
    }

[1m  # module.lightsail.aws_lightsail_static_ip_attachment.instance[0][0m will be created
[0m  [32m+[0m[0m resource "aws_lightsail_static_ip_attachment" "instance" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m instance_name  = (known after apply)
      [32m+[0m[0m ip_address     = (known after apply)
      [32m+[0m[0m static_ip_name = (known after apply)
    }

[1mPlan:[0m 5 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
stdout<<ghadelimiter_a079249f-9de8-4ae3-a0c6-4f041d6899ea

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # module.lightsail.aws_lightsail_domain.test[0][0m will be created
[0m  [32m+[0m[0m resource "aws_lightsail_domain" "test" {
      [32m+[0m[0m arn         = (known after apply)
      [32m+[0m[0m domain_name = "clouddrove.ca"
      [32m+[0m[0m id          = (known after apply)
    }

[1m  # module.lightsail.aws_lightsail_instance.instance[0][0m will be created
[0m  [32m+[0m[0m resource "aws_lightsail_instance" "instance" {
      [32m+[0m[0m arn                = (known after apply)
      [32m+[0m[0m availability_zone  = (sensitive value)
      [32m+[0m[0m blueprint_id       = (sensitive value)
      [32m+[0m[0m bundle_id          = (sensitive value)
      [32m+[0m[0m cpu_count          = (known after apply)
      [32m+[0m[0m created_at         = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m ip_address_type    = "dualstack"
      [32m+[0m[0m ipv6_addresses     = (known after apply)
      [32m+[0m[0m is_static_ip       = (known after apply)
      [32m+[0m[0m name               = "flick-loco-01_lightsail-0"
      [32m+[0m[0m private_ip_address = (known after apply)
      [32m+[0m[0m public_ip_address  = (known after apply)
      [32m+[0m[0m ram_size           = (known after apply)
      [32m+[0m[0m tags               = {
          [32m+[0m[0m "Environment" = "01_lightsail"
          [32m+[0m[0m "Managedby"   = "hello@clouddrove.com"
          [32m+[0m[0m "Name"        = "flick-loco-01_lightsail-0"
          [32m+[0m[0m "Repository"  = "https://github.com/clouddrove/terraform-aws-lightsail"
        }
      [32m+[0m[0m tags_all           = {
          [32m+[0m[0m "Environment" = "01_lightsail"
          [32m+[0m[0m "Managedby"   = "hello@clouddrove.com"
          [32m+[0m[0m "Name"        = "flick-loco-01_lightsail-0"
          [32m+[0m[0m "Repository"  = "https://github.com/clouddrove/terraform-aws-lightsail"
        }
      [32m+[0m[0m username           = (known after apply)
    }

[1m  # module.lightsail.aws_lightsail_instance_public_ports.public[0m will be created
[0m  [32m+[0m[0m resource "aws_lightsail_instance_public_ports" "public" {
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m instance_name = "flick-loco-01_lightsail-0"

      [32m+[0m[0m port_info {
          [32m+[0m[0m cidr_list_aliases = (known after apply)
          [32m+[0m[0m cidrs             = [
              [32m+[0m[0m "0.0.0.0/0",
            ]
          [32m+[0m[0m from_port         = 22
          [32m+[0m[0m ipv6_cidrs        = (known after apply)
          [32m+[0m[0m protocol          = "tcp"
          [32m+[0m[0m to_port           = 22
        }
      [32m+[0m[0m port_info {
          [32m+[0m[0m cidr_list_aliases = (known after apply)
          [32m+[0m[0m cidrs             = [
              [32m+[0m[0m "0.0.0.0/0",
            ]
          [32m+[0m[0m from_port         = 80
          [32m+[0m[0m ipv6_cidrs        = (known after apply)
          [32m+[0m[0m protocol          = "tcp"
          [32m+[0m[0m to_port           = 80
        }
    }

[1m  # module.lightsail.aws_lightsail_static_ip.instance[0][0m will be created
[0m  [32m+[0m[0m resource "aws_lightsail_static_ip" "instance" {
      [32m+[0m[0m arn          = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m ip_address   = (known after apply)
      [32m+[0m[0m name         = "flick-loco-01_lightsail-IP-0"
      [32m+[0m[0m support_code = (known after apply)
    }

[1m  # module.lightsail.aws_lightsail_static_ip_attachment.instance[0][0m will be created
[0m  [32m+[0m[0m resource "aws_lightsail_static_ip_attachment" "instance" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m instance_name  = (known after apply)
      [32m+[0m[0m ip_address     = (known after apply)
      [32m+[0m[0m static_ip_name = (known after apply)
    }

[1mPlan:[0m 5 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

ghadelimiter_a079249f-9de8-4ae3-a0c6-4f041d6899ea
stderr<<ghadelimiter_87371a73-0712-43eb-82c7-f3adda53ed60

ghadelimiter_87371a73-0712-43eb-82c7-f3adda53ed60
exitcode<<ghadelimiter_05135835-e960-439d-b149-0998d6b39e71
0
ghadelimiter_05135835-e960-439d-b149-0998d6b39e71
[0m[1mdata.archive_file.prune_snapshots_lambda_zip: Reading...[0m[0m
[0m[1mdata.archive_file.create_snapshots_lambda_zip: Reading...[0m[0m
[0m[1mdata.archive_file.create_snapshots_lambda_zip: Read complete after 0s [id=bece331b2842e195a32a8f95b860623eff5f8a61][0m
[0m[1mdata.archive_file.prune_snapshots_lambda_zip: Read complete after 0s [id=cc8b36859de88d6a02c7adf27a2752c76672bbca][0m
[0m[1mmodule.create_instance_snapshot_lambda.data.external.archive_prepare[0]: Reading...[0m[0m
[0m[1mmodule.prune_instance_snapshot_lambda.data.external.archive_prepare[0]: Reading...[0m[0m
[0m[1mmodule.create_instance_snapshot_lambda.data.external.archive_prepare[0]: Read complete after 0s [id=-][0m
[0m[1mmodule.prune_instance_snapshot_lambda.data.external.archive_prepare[0]: Read complete after 0s [id=-][0m
[0m[1mmodule.eventbridge.data.aws_cloudwatch_event_bus.this[0]: Reading...[0m[0m
[0m[1mmodule.prune_instance_snapshot_lambda.data.aws_partition.current: Reading...[0m[0m
[0m[1mmodule.eventbridge.data.aws_iam_policy_document.assume_role[0]: Reading...[0m[0m
[0m[1mmodule.iam_assumable_role_custom_trust_policy.data.aws_partition.current: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.lambda_role: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.lambda_role: Read complete after 0s [id=2690255455][0m
[0m[1mmodule.iam_assumable_role_custom_trust_policy.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.prune_instance_snapshot_lambda.data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.eventbridge.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3959961479][0m
[0m[1mmodule.iam_assumable_role_custom_trust_policy.data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.create_instance_snapshot_lambda.data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.eventbridge.data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.prune_instance_snapshot_lambda.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.create_instance_snapshot_lambda.data.aws_region.current: Read complete after 0s [id=us-east-1][0m
[0m[1mmodule.create_instance_snapshot_lambda.data.aws_partition.current: Reading...[0m[0m
[0m[1mmodule.eventbridge.data.aws_region.current: Read complete after 0s [id=us-east-1][0m
[0m[1mmodule.prune_instance_snapshot_lambda.data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.create_instance_snapshot_lambda.data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.eventbridge.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.create_instance_snapshot_lambda.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.eventbridge.data.aws_partition.current: Reading...[0m[0m
[0m[1mmodule.iam_assumable_role_custom_trust_policy.data.aws_caller_identity.current: Read complete after 0s [id=074217812019][0m
[0m[1mmodule.prune_instance_snapshot_lambda.data.aws_region.current: Read complete after 0s [id=us-east-1][0m
[0m[1mmodule.create_instance_snapshot_lambda.data.aws_iam_policy_document.assume_role[0]: Reading...[0m[0m
[0m[1mmodule.eventbridge.data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.create_instance_snapshot_lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455][0m
[0m[1mmodule.prune_instance_snapshot_lambda.data.aws_iam_policy_document.assume_role[0]: Reading...[0m[0m
[0m[1mmodule.iam_assumable_role_custom_trust_policy.data.aws_iam_policy_document.assume_role[0]: Reading...[0m[0m
[0m[1mmodule.prune_instance_snapshot_lambda.data.aws_caller_identity.current: Read complete after 0s [id=074217812019][0m
[0m[1mmodule.iam_assumable_role_custom_trust_policy.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=910968458][0m
[0m[1mmodule.prune_instance_snapshot_lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455][0m
[0m[1mmodule.create_instance_snapshot_lambda.data.aws_caller_identity.current: Read complete after 0s [id=074217812019][0m
[0m[1mmodule.eventbridge.data.aws_caller_identity.current: Read complete after 0s [id=074217812019][0m
[0m[1mmodule.eventbridge.data.aws_cloudwatch_event_bus.this[0]: Read complete after 0s [id=default][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # module.create_instance_snapshot_lambda.data.aws_iam_policy_document.logs[0][0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_iam_policy_document" "logs" {
      [32m+[0m[0m id   = (known after apply)
      [32m+[0m[0m json = (known after apply)

      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "logs:CreateLogGroup",
              [32m+[0m[0m "logs:CreateLogStream",
              [32m+[0m[0m "logs:PutLogEvents",
            ]
          [32m+[0m[0m effect    = "Allow"
          [32m+[0m[0m resources = (known after apply)
        }
    }

[1m  # module.create_instance_snapshot_lambda.aws_cloudwatch_log_group.lambda[0][0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_log_group" "lambda" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m log_group_class   = (known after apply)
      [32m+[0m[0m name              = "/aws/lambda/createLightSailSnapshots"
      [32m+[0m[0m name_prefix       = (known after apply)
      [32m+[0m[0m retention_in_days = 0
      [32m+[0m[0m skip_destroy      = false
      [32m+[0m[0m tags_all          = (known after apply)
    }

[1m  # module.create_instance_snapshot_lambda.aws_iam_policy.logs[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "logs" {
      [32m+[0m[0m arn         = (known after apply)
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m name        = "createLightSailSnapshots-logs"
      [32m+[0m[0m name_prefix = (known after apply)
      [32m+[0m[0m path        = "/"
      [32m+[0m[0m policy      = (known after apply)
      [32m+[0m[0m policy_id   = (known after apply)
      [32m+[0m[0m tags_all    = (known after apply)
    }

[1m  # module.create_instance_snapshot_lambda.aws_iam_role.lambda[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "lambda" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = true
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "createLightSailSnapshots"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags_all              = (known after apply)
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # module.create_instance_snapshot_lambda.aws_iam_role_policy_attachment.logs[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "logs" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = "createLightSailSnapshots"
    }

[1m  # module.create_instance_snapshot_lambda.aws_lambda_function.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_function" "this" {
      [32m+[0m[0m architectures                  = (known after apply)
      [32m+[0m[0m arn                            = (known after apply)
      [32m+[0m[0m filename                       = "lightsail-create-instance-snapshots.zip"
      [32m+[0m[0m function_name                  = "createLightSailSnapshots"
      [32m+[0m[0m handler                        = "index.handler"
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m invoke_arn                     = (known after apply)
      [32m+[0m[0m last_modified                  = (known after apply)
      [32m+[0m[0m memory_size                    = 128
      [32m+[0m[0m package_type                   = "Zip"
      [32m+[0m[0m publish                        = false
      [32m+[0m[0m qualified_arn                  = (known after apply)
      [32m+[0m[0m qualified_invoke_arn           = (known after apply)
      [32m+[0m[0m reserved_concurrent_executions = -1
      [32m+[0m[0m role                           = (known after apply)
      [32m+[0m[0m runtime                        = "nodejs20.x"
      [32m+[0m[0m signing_job_arn                = (known after apply)
      [32m+[0m[0m signing_profile_version_arn    = (known after apply)
      [32m+[0m[0m skip_destroy                   = false
      [32m+[0m[0m source_code_hash               = "pPetlZ3KQXWfwu1tsehgC16jcraiLKNDhcl7DCmn+wg="
      [32m+[0m[0m source_code_size               = (known after apply)
      [32m+[0m[0m tags_all                       = (known after apply)
      [32m+[0m[0m timeout                        = 3
      [32m+[0m[0m version                        = (known after apply)

      [32m+[0m[0m environment {
          [32m+[0m[0m variables = {
              [32m+[0m[0m "ENV"           = "dev"
              [32m+[0m[0m "INSTANCE_NAME" = "lambda-create-snapshot-flick-loco-dev"
            }
        }

      [32m+[0m[0m ephemeral_storage {
          [32m+[0m[0m size = 512
        }

      [32m+[0m[0m timeouts {}
    }

[1m  # module.create_instance_snapshot_lambda.aws_lambda_permission.unqualified_alias_triggers["Config"][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_permission" "unqualified_alias_triggers" {
      [32m+[0m[0m action              = "lambda:InvokeFunction"
      [32m+[0m[0m function_name       = "createLightSailSnapshots"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m principal           = "config.amazonaws.com"
      [32m+[0m[0m source_arn          = (known after apply)
      [32m+[0m[0m statement_id        = "AllowExecutionFromCloudWatch"
      [32m+[0m[0m statement_id_prefix = (known after apply)
    }

[1m  # module.create_instance_snapshot_lambda.local_file.archive_plan[0][0m will be created
[0m  [32m+[0m[0m resource "local_file" "archive_plan" {
      [32m+[0m[0m content              = jsonencode(
            {
              [32m+[0m[0m artifacts_dir = "builds"
              [32m+[0m[0m build_plan    = [
                  [32m+[0m[0m [
                      [32m+[0m[0m "zip",
                      [32m+[0m[0m "./lightsail-create-instance-snapshots.zip",
                      [32m+[0m[0m [90mnull[0m[0m,
                    ],
                ]
              [32m+[0m[0m filename      = "builds/5eb798266e2db8cdf0c9c981f002ad5b9b39014a8cd1d6dadff62f4459b66eba.zip"
              [32m+[0m[0m runtime       = "nodejs20.x"
            }
        )
      [32m+[0m[0m content_base64sha256 = (known after apply)
      [32m+[0m[0m content_base64sha512 = (known after apply)
      [32m+[0m[0m content_md5          = (known after apply)
      [32m+[0m[0m content_sha1         = (known after apply)
      [32m+[0m[0m content_sha256       = (known after apply)
      [32m+[0m[0m content_sha512       = (known after apply)
      [32m+[0m[0m directory_permission = "0755"
      [32m+[0m[0m file_permission      = "0644"
      [32m+[0m[0m filename             = "builds/5eb798266e2db8cdf0c9c981f002ad5b9b39014a8cd1d6dadff62f4459b66eba.plan.json"
      [32m+[0m[0m id                   = (known after apply)
    }

[1m  # module.create_instance_snapshot_lambda.null_resource.archive[0][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "archive" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "filename"  = "builds/5eb798266e2db8cdf0c9c981f002ad5b9b39014a8cd1d6dadff62f4459b66eba.zip"
          [32m+[0m[0m "timestamp" = "1708838411766754000"
        }
    }

[1m  # module.eventbridge.aws_cloudwatch_event_rule.this["crons"][0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_event_rule" "this" {
      [32m+[0m[0m arn                 = (known after apply)
      [32m+[0m[0m description         = "Trigger the createLightSailSnapshots and pruneLightSailSnapshots light to modify snapshots."
      [32m+[0m[0m event_bus_name      = "default"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m is_enabled          = true
      [32m+[0m[0m name                = "crons-rule"
      [32m+[0m[0m name_prefix         = (known after apply)
      [32m+[0m[0m schedule_expression = "rate(1 day)"
      [32m+[0m[0m tags                = {
          [32m+[0m[0m "Name" = "crons-rule"
        }
      [32m+[0m[0m tags_all            = {
          [32m+[0m[0m "Name" = "crons-rule"
        }
    }

[1m  # module.eventbridge.aws_cloudwatch_event_target.this["LightsailSnapshotSchedule_create"][0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_event_target" "this" {
      [32m+[0m[0m arn            = (known after apply)
      [32m+[0m[0m event_bus_name = "default"
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m rule           = "crons-rule"
      [32m+[0m[0m target_id      = "TriggerCreateLightsailSnapshots"
    }

[1m  # module.eventbridge.aws_cloudwatch_event_target.this["LightsailSnapshotSchedule_prune"][0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_event_target" "this" {
      [32m+[0m[0m arn            = (known after apply)
      [32m+[0m[0m event_bus_name = "default"
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m rule           = "crons-rule"
      [32m+[0m[0m target_id      = "TriggerPruneLightsailSnapshots"
    }

[1m  # module.eventbridge.aws_iam_role.eventbridge[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "eventbridge" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "events.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = true
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "default"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Name" = "default"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Name" = "default"
        }
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # module.iam_assumable_role_custom_trust_policy.aws_iam_role.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "this" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m description           = "Policy to Create / Delete Lightsail Snapshots"
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "LambdaModifyLightsailSnapshotsRole"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags_all              = (known after apply)
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # module.iam_assumable_role_custom_trust_policy.aws_iam_role_policy_attachment.custom[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "custom" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = "LambdaModifyLightsailSnapshotsRole"
    }

[1m  # module.iam_policy.aws_iam_policy.policy[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "policy" {
      [32m+[0m[0m arn         = (known after apply)
      [32m+[0m[0m description = "IAM Policy"
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m name        = "LamdbaModifyLightsailSnapshotsPolicy"
      [32m+[0m[0m name_prefix = (known after apply)
      [32m+[0m[0m path        = "/"
      [32m+[0m[0m policy      = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action   = [
                          [32m+[0m[0m "lightsail:*",
                        ]
                      [32m+[0m[0m Effect   = "Allow"
                      [32m+[0m[0m Resource = "*"
                      [32m+[0m[0m Sid      = "LightsailFullAccess"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m Action   = "logs:*"
                      [32m+[0m[0m Effect   = "Allow"
                      [32m+[0m[0m Resource = "*"
                      [32m+[0m[0m Sid      = "LogsFullAccess"
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m policy_id   = (known after apply)
      [32m+[0m[0m tags_all    = (known after apply)
    }

[1m  # module.prune_instance_snapshot_lambda.data.aws_iam_policy_document.logs[0][0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_iam_policy_document" "logs" {
      [32m+[0m[0m id   = (known after apply)
      [32m+[0m[0m json = (known after apply)

      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "logs:CreateLogGroup",
              [32m+[0m[0m "logs:CreateLogStream",
              [32m+[0m[0m "logs:PutLogEvents",
            ]
          [32m+[0m[0m effect    = "Allow"
          [32m+[0m[0m resources = (known after apply)
        }
    }

[1m  # module.prune_instance_snapshot_lambda.aws_cloudwatch_log_group.lambda[0][0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_log_group" "lambda" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m log_group_class   = (known after apply)
      [32m+[0m[0m name              = "/aws/lambda/pruneLightSailSnapshots"
      [32m+[0m[0m name_prefix       = (known after apply)
      [32m+[0m[0m retention_in_days = 0
      [32m+[0m[0m skip_destroy      = false
      [32m+[0m[0m tags_all          = (known after apply)
    }

[1m  # module.prune_instance_snapshot_lambda.aws_iam_policy.logs[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "logs" {
      [32m+[0m[0m arn         = (known after apply)
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m name        = "pruneLightSailSnapshots-logs"
      [32m+[0m[0m name_prefix = (known after apply)
      [32m+[0m[0m path        = "/"
      [32m+[0m[0m policy      = (known after apply)
      [32m+[0m[0m policy_id   = (known after apply)
      [32m+[0m[0m tags_all    = (known after apply)
    }

[1m  # module.prune_instance_snapshot_lambda.aws_iam_role.lambda[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "lambda" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = true
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "pruneLightSailSnapshots"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags_all              = (known after apply)
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # module.prune_instance_snapshot_lambda.aws_iam_role_policy_attachment.logs[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "logs" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = "pruneLightSailSnapshots"
    }

[1m  # module.prune_instance_snapshot_lambda.aws_lambda_function.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_function" "this" {
      [32m+[0m[0m architectures                  = (known after apply)
      [32m+[0m[0m arn                            = (known after apply)
      [32m+[0m[0m filename                       = "lightsail-prune-instance-snapshots.zip"
      [32m+[0m[0m function_name                  = "pruneLightSailSnapshots"
      [32m+[0m[0m handler                        = "index.handler"
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m invoke_arn                     = (known after apply)
      [32m+[0m[0m last_modified                  = (known after apply)
      [32m+[0m[0m memory_size                    = 128
      [32m+[0m[0m package_type                   = "Zip"
      [32m+[0m[0m publish                        = false
      [32m+[0m[0m qualified_arn                  = (known after apply)
      [32m+[0m[0m qualified_invoke_arn           = (known after apply)
      [32m+[0m[0m reserved_concurrent_executions = -1
      [32m+[0m[0m role                           = (known after apply)
      [32m+[0m[0m runtime                        = "nodejs20.x"
      [32m+[0m[0m signing_job_arn                = (known after apply)
      [32m+[0m[0m signing_profile_version_arn    = (known after apply)
      [32m+[0m[0m skip_destroy                   = false
      [32m+[0m[0m source_code_hash               = "SNDPTkN+sO3/ufgcQCNLRXCW1C71Wtwe4R+Q7A1ORts="
      [32m+[0m[0m source_code_size               = (known after apply)
      [32m+[0m[0m tags_all                       = (known after apply)
      [32m+[0m[0m timeout                        = 3
      [32m+[0m[0m version                        = (known after apply)

      [32m+[0m[0m environment {
          [32m+[0m[0m variables = {
              [32m+[0m[0m "ENV"              = "dev"
              [32m+[0m[0m "INSTANCE_NAME"    = "lambda-prune-snapshot-flick-loco-dev"
              [32m+[0m[0m "RETENTION_PERIOD" = "2"
            }
        }

      [32m+[0m[0m ephemeral_storage {
          [32m+[0m[0m size = 512
        }

      [32m+[0m[0m timeouts {}
    }

[1m  # module.prune_instance_snapshot_lambda.aws_lambda_permission.unqualified_alias_triggers["Config"][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_permission" "unqualified_alias_triggers" {
      [32m+[0m[0m action              = "lambda:InvokeFunction"
      [32m+[0m[0m function_name       = "pruneLightSailSnapshots"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m principal           = "config.amazonaws.com"
      [32m+[0m[0m source_arn          = (known after apply)
      [32m+[0m[0m statement_id        = "AllowExecutionFromCloudWatch"
      [32m+[0m[0m statement_id_prefix = (known after apply)
    }

[1m  # module.prune_instance_snapshot_lambda.local_file.archive_plan[0][0m will be created
[0m  [32m+[0m[0m resource "local_file" "archive_plan" {
      [32m+[0m[0m content              = jsonencode(
            {
              [32m+[0m[0m artifacts_dir = "builds"
              [32m+[0m[0m build_plan    = [
                  [32m+[0m[0m [
                      [32m+[0m[0m "zip",
                      [32m+[0m[0m "./lightsail-prune-instance-snapshots.zip",
                      [32m+[0m[0m [90mnull[0m[0m,
                    ],
                ]
              [32m+[0m[0m filename      = "builds/550d5da2ed748756628f9fd4ffbc460b10a72d5756ed5d274b5c125ea5b52aba.zip"
              [32m+[0m[0m runtime       = "nodejs20.x"
            }
        )
      [32m+[0m[0m content_base64sha256 = (known after apply)
      [32m+[0m[0m content_base64sha512 = (known after apply)
      [32m+[0m[0m content_md5          = (known after apply)
      [32m+[0m[0m content_sha1         = (known after apply)
      [32m+[0m[0m content_sha256       = (known after apply)
      [32m+[0m[0m content_sha512       = (known after apply)
      [32m+[0m[0m directory_permission = "0755"
      [32m+[0m[0m file_permission      = "0644"
      [32m+[0m[0m filename             = "builds/550d5da2ed748756628f9fd4ffbc460b10a72d5756ed5d274b5c125ea5b52aba.plan.json"
      [32m+[0m[0m id                   = (known after apply)
    }

[1m  # module.prune_instance_snapshot_lambda.null_resource.archive[0][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "archive" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "filename"  = "builds/550d5da2ed748756628f9fd4ffbc460b10a72d5756ed5d274b5c125ea5b52aba.zip"
          [32m+[0m[0m "timestamp" = "1708838411779939800"
        }
    }

[1mPlan:[0m 23 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m arn                   = (known after apply)
  [32m+[0m[0m arn_ev                = ""
  [32m+[0m[0m eventbridge_rule_arns = {
      [32m+[0m[0m crons = (known after apply)
    }
  [32m+[0m[0m fn_name_prune         = "pruneLightSailSnapshots"
  [32m+[0m[0m fn_name_snapshot      = "createLightSailSnapshots"
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mArgument is deprecated[0m
[33m│[0m [0m
[33m│[0m [0m[0m  with module.eventbridge.aws_cloudwatch_event_rule.this["crons"],
[33m│[0m [0m  on .terraform/modules/eventbridge/main.tf line 91, in resource "aws_cloudwatch_event_rule" "this":
[33m│[0m [0m  91:   is_enabled          = [4mlookup(each.value, "enabled", true)[0m[0m
[33m│[0m [0m
[33m│[0m [0mUse "state" instead
[33m╵[0m[0m
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
stdout<<ghadelimiter_ddb68207-d6b3-42c3-aacb-079f69c028de
[0m[1mdata.archive_file.prune_snapshots_lambda_zip: Reading...[0m[0m
[0m[1mdata.archive_file.create_snapshots_lambda_zip: Reading...[0m[0m
[0m[1mdata.archive_file.create_snapshots_lambda_zip: Read complete after 0s [id=bece331b2842e195a32a8f95b860623eff5f8a61][0m
[0m[1mdata.archive_file.prune_snapshots_lambda_zip: Read complete after 0s [id=cc8b36859de88d6a02c7adf27a2752c76672bbca][0m
[0m[1mmodule.create_instance_snapshot_lambda.data.external.archive_prepare[0]: Reading...[0m[0m
[0m[1mmodule.prune_instance_snapshot_lambda.data.external.archive_prepare[0]: Reading...[0m[0m
[0m[1mmodule.create_instance_snapshot_lambda.data.external.archive_prepare[0]: Read complete after 0s [id=-][0m
[0m[1mmodule.prune_instance_snapshot_lambda.data.external.archive_prepare[0]: Read complete after 0s [id=-][0m
[0m[1mmodule.eventbridge.data.aws_cloudwatch_event_bus.this[0]: Reading...[0m[0m
[0m[1mmodule.prune_instance_snapshot_lambda.data.aws_partition.current: Reading...[0m[0m
[0m[1mmodule.eventbridge.data.aws_iam_policy_document.assume_role[0]: Reading...[0m[0m
[0m[1mmodule.iam_assumable_role_custom_trust_policy.data.aws_partition.current: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.lambda_role: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.lambda_role: Read complete after 0s [id=2690255455][0m
[0m[1mmodule.iam_assumable_role_custom_trust_policy.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.prune_instance_snapshot_lambda.data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.eventbridge.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3959961479][0m
[0m[1mmodule.iam_assumable_role_custom_trust_policy.data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.create_instance_snapshot_lambda.data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.eventbridge.data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.prune_instance_snapshot_lambda.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.create_instance_snapshot_lambda.data.aws_region.current: Read complete after 0s [id=us-east-1][0m
[0m[1mmodule.create_instance_snapshot_lambda.data.aws_partition.current: Reading...[0m[0m
[0m[1mmodule.eventbridge.data.aws_region.current: Read complete after 0s [id=us-east-1][0m
[0m[1mmodule.prune_instance_snapshot_lambda.data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.create_instance_snapshot_lambda.data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.eventbridge.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.create_instance_snapshot_lambda....*[Comment body truncated]*